; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 795745 2 3 3 6 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	infrared2 - mode
	image0 - mode
	thermograph1 - mode
	GroundStation0 - direction
	GroundStation3 - direction
	Star4 - direction
	Star2 - direction
	Star5 - direction
	Star1 - direction
	Planet6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star1)
	(supports instrument1 infrared2)
	(supports instrument1 thermograph1)
	(supports instrument1 image0)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument2 thermograph1)
	(supports instrument2 infrared2)
	(supports instrument2 image0)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 Star5)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet6)
)
(:goal (and
	(pointing satellite1 Star5)
	(have_image Planet6 image0)
	(have_image Star7 image0)
	(have_image Phenomenon8 image0)
	(have_image Planet9 image0)
	(have_image Phenomenon10 thermograph1)
	(have_image Phenomenon11 image0)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 7
2. (turn_to satellite1 star5 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star5)
   goals met: 1 of 7
3. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 7
4. (turn_to satellite0 star7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star7)
   goals met: 1 of 7
5. (calibrate satellite1 instrument2 star5)
   added: (calibrated instrument2)
   goals met: 1 of 7
6. (turn_to satellite0 planet9 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet9)
   goals met: 1 of 7
7. (turn_to satellite1 star7 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star7)
   goals met: 0 of 7
8. (turn_to satellite0 star2 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star2)
   goals met: 0 of 7
9. (take_image satellite1 star7 instrument2 image0)
   added: (have_image star7 image0)
   goals met: 1 of 7
10. (calibrate satellite0 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 1 of 7
11. (turn_to satellite1 star5 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star5)
   goals met: 2 of 7
12. (turn_to satellite0 planet9 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet9)
   goals met: 2 of 7
13. (take_image satellite0 planet9 instrument1 image0)
   added: (have_image planet9 image0)
   goals met: 3 of 7
14. (turn_to satellite1 phenomenon8 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 phenomenon8)
   goals met: 2 of 7
15. (turn_to satellite0 planet6 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet6)
   goals met: 2 of 7
16. (take_image satellite1 phenomenon8 instrument2 image0)
   added: (have_image phenomenon8 image0)
   goals met: 3 of 7
17. (turn_to satellite1 star5 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star5)
   goals met: 4 of 7
18. (take_image satellite0 planet6 instrument1 image0)
   added: (have_image planet6 image0)
   goals met: 5 of 7
19. (turn_to satellite0 phenomenon11 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 phenomenon11)
   goals met: 5 of 7
20. (turn_to satellite1 phenomenon10 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 phenomenon10)
   goals met: 4 of 7
21. (take_image satellite0 phenomenon11 instrument1 image0)
   added: (have_image phenomenon11 image0)
   goals met: 5 of 7
22. (take_image satellite1 phenomenon10 instrument2 thermograph1)
   added: (have_image phenomenon10 thermograph1)
   goals met: 6 of 7
23. (turn_to satellite1 star5 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star5)
   goals met: 7 of 7
